update folder strcuture with mermaid syntax
